guangli2015/freertos_nRF54l15/Source/nrfx/drivers/src/nrfx_uarte.c
/*
 * Copyright (c) 2015 - 2025, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 */

#include <nrfx.h>
//#define NRFX_UARTE_ENABLED 1
//#define NRFX_UARTE30_ENABLED 1
//#define NRFX_UARTE00_ENABLED 1
//#define NRFX_UARTE20_ENABLED 1


//#define NRFX_UARTE21_ENABLED 1


//#define NRFX_UARTE22_ENABLED 1

#if NRFX_CHECK(NRFX_UARTE_ENABLED)

#if !NRFX_FEATURE_PRESENT(NRFX_UARTE, _ENABLED)
#error "No enabled UARTE instances. Check <nrfx_config.h>."
#endif

#include <nrfx_uarte.h>
#include "prs/nrfx_prs.h"
#include <haly/nrfy_gpio.h>
#include <string.h>
#include <soc/nrfx_coredep.h>

#define NRFX_LOG_MODULE UARTE
#include <nrfx_log.h>

#define UARTEX_LENGTH_VALIDATE(periph_name, prefix, i, drv_inst_idx, len1, len2) \
    (((drv_inst_idx) == NRFX_CONCAT(NRFX_, periph_name, prefix, i, _INST_IDX)) && \
     NRFX_EASYDMA_LENGTH_VALIDATE(NRFX_CONCAT(periph_name, prefix, i), len1, len2))

#define UARTE_LENGTH_VALIDATE(drv_inst_idx, len)    \
        (NRFX_FOREACH_ENABLED(UARTE, UARTEX_LENGTH_VALIDATE, (||), (0), drv_inst_idx, len, 0))

#if NRFX_CHECK(NRFX_UARTE_CONFIG_RX_CACHE_ENABLED)
// Internal cache buffer is used if buffers provided by a user cannot be used in DMA. This is a
// HW limitation on some platforms but for testing purposes it can be emulated on any platform.
#define RX_CACHE_SUPPORTED 1
#else
#define RX_CACHE_SUPPORTED 0
#endif

#define MIN_RX_CACHE_SIZE 8
// There is a HW bug which results in RX amount value not being updated when FIFO was empty.
// It is then hard to determine if FIFO contained anything or not.
#define USE_WORKAROUND_FOR_FLUSHRX_ANOMALY 1

// Size of the RX HW FIFO
#define UARTE_HW_RX_FIFO_SIZE 5

// Set of flags which if needed are atomically controlled. Flags maintain current state and
// configuration.
#define UARTE_FLAG_TX_CNT      12 // Max amount of TX flags
#define UARTE_FLAG_RX_CNT      12 // Max amount of RX flags
#define UARTE_FLAG_MISC_CNT    8  // Max amount of miscellaneous flags

#define UARTE_FLAG_TX_OFFSET   0
#define UARTE_FLAG_RX_OFFSET   UARTE_FLAG_TX_CNT
#define UARTE_FLAG_MISC_OFFSET (UARTE_FLAG_RX_OFFSET + UARTE_FLAG_RX_CNT)

#define UARTE_FLAG(type, i) \
    NRFX_BIT(NRFX_CONCAT(UARTE_FLAG_,type,_OFFSET) + i)

// Mask with all RX flags
#define UARTE_RX_FLAGS (NRFX_BIT_MASK(UARTE_FLAG_RX_CNT) << UARTE_FLAG_RX_OFFSET)

// Flag set when there is a PPI connection set up between ENDTX event and TXSTOP task.
#define UARTE_FLAG_TX_STOP_ON_END          UARTE_FLAG(TX, 0)
//
// Flag is set when internal TX buffer is used as a cache/proxy buffer. It is used when user buffer
// is in the memory that cannot be used by the DMA.
#define UARTE_FLAG_TX_USE_CACHE            UARTE_FLAG(TX, 1)

// Flag is used to indicate that asynchronous TX transfer request occured during blocking transfer.
// Asynchronous pending transfer is started immediately after the current blocking transfer is
// completed.
#define UARTE_FLAG_TX_PENDING              UARTE_FLAG(TX, 2)

// Flag indicates that TX abort is in progress.
#define UARTE_FLAG_TX_ABORTED              UARTE_FLAG(TX, 3)

// Flag indicates that TX transfers are linked (by ENDTX-STARTTX PPI connection set up by the user).
#define UARTE_FLAG_TX_LINKED               UARTE_FLAG(TX, 4)

// Flag is set when receiver is active.
#define UARTE_FLAG_RX_ENABLED              UARTE_FLAG(RX, 0)

// Flag is set if receiver is enabled with flag NRFX_UARTE_RX_ENABLE_STOP_ON_END.
#define UARTE_FLAG_RX_STOP_ON_END          UARTE_FLAG(RX, 1)

// Flag is set if receiver is enabled with flag NRFX_UARTE_RX_ENABLE_CONT.
#define UARTE_FLAG_RX_CONT                 UARTE_FLAG(RX, 2)

// Flag is set if receiver is enabled with flag NRFX_UARTE_RX_ENABLE_KEEP_FIFO_CONTENT.
#define UARTE_FLAG_RX_KEEP_FIFO_CONTENT    UARTE_FLAG(RX, 3)

// Flag indicates that RX abort was done to seamlessly switch the DMA buffer and not to abort the
// transfer.
#define UARTE_FLAG_RX_RESTARTED            UARTE_FLAG(RX, 4)

// Flag is set when internal RX buffer is used as a cache/proxy buffer. It is used when user buffer
// is in the memory that cannot be used by the DMA.
#define UARTE_FLAG_RX_USE_CACHE            UARTE_FLAG(RX, 5)

// Flag indicates that RX was aborted.
#define UARTE_FLAG_RX_ABORTED              UARTE_FLAG(RX, 6)

// Flag indicates that there are new bytes from flushed buffer copied to the user buffer.
#define UARTE_FLAG_RX_FROM_FLUSH           UARTE_FLAG(RX, 7)

// Flag indicates user explicitly aborted RX.
#define UARTE_FLAG_RX_FORCED_ABORT         UARTE_FLAG(RX, 8)

// Flag is set if instance was configured to control PSEL pins during the initialization.
#define UARTE_FLAG_PSEL_UNINIT             UARTE_FLAG(MISC, 0)

// Flag is set if instance was configured to control GPIO pins during the initialization.
#define UARTE_FLAG_GPIO_UNINIT             UARTE_FLAG(MISC, 1)

// Flag is atomically set when nrfx_uarte_int_trigger is called.
#define UARTE_FLAG_TRIGGER                 UARTE_FLAG(MISC, 2)

// Flag indicates that HWFC pins are being configured.
#define UARTE_FLAG_HWFC_PINS               UARTE_FLAG(MISC, 3)

typedef struct
{
    /* User provided buffers. */
    nrfy_uarte_buffer_t     curr;
    nrfy_uarte_buffer_t     next;
    nrfy_uarte_buffer_t     flush;
    nrfx_uarte_rx_cache_t * p_cache;
    size_t                  off;
} uarte_rx_data_t;

typedef struct
{
    nrfy_uarte_buffer_t curr;
    nrfy_uarte_buffer_t next;
    nrfy_uarte_buffer_t cache;
    size_t              off;
    int                 amount;
} uarte_tx_data_t;

typedef struct
{
    void                     * p_context;
    nrfx_uarte_event_handler_t handler;
    uarte_rx_data_t            rx;
    uarte_tx_data_t            tx;
    nrfx_drv_state_t           state;
    nrfx_atomic_t              flags;
} uarte_control_block_t;

static uarte_control_block_t m_cb[NRFX_UARTE_ENABLED_COUNT];

