guangli2015/freertos_nRF54l15/Source/nrfx/drivers/src/nrfx_uarte.c
static const uint32_t rx_int_mask = NRF_UARTE_INT_ERROR_MASK |
                                    NRF_UARTE_INT_ENDRX_MASK |
                                    NRF_UARTE_INT_RXTO_MASK |
                                    NRF_UARTE_INT_RXSTARTED_MASK;

static void apply_workaround_for_enable_anomaly(nrfx_uarte_t const * p_instance);

static void uarte_configure(nrfx_uarte_t        const * p_instance,
                            nrfx_uarte_config_t const * p_config)
{
    uarte_control_block_t * p_cb = &m_cb[p_instance->drv_inst_idx];

    if (!NRFX_IS_ENABLED(NRFX_UARTE_CONFIG_SKIP_GPIO_CONFIG) &&
        (p_config->skip_gpio_cfg == false))
    {
        p_cb->flags |= UARTE_FLAG_GPIO_UNINIT;
        if (p_config->txd_pin != NRF_UARTE_PSEL_DISCONNECTED)
        {
            nrfy_gpio_pin_set(p_config->txd_pin);
            nrfy_gpio_cfg_output(p_config->txd_pin);
#if NRF_GPIO_HAS_CLOCKPIN && defined(NRF_UARTE_CLOCKPIN_TXD_NEEDED)
            nrfy_gpio_pin_clock_set(p_config->txd_pin, true);
#endif
        }
        if (p_config->rxd_pin != NRF_UARTE_PSEL_DISCONNECTED)
        {
            nrfy_gpio_cfg_input(p_config->rxd_pin, NRF_GPIO_PIN_NOPULL);
        }
    }

    if (!NRFX_IS_ENABLED(NRFX_UARTE_CONFIG_SKIP_GPIO_CONFIG) &&
        (p_config->config.hwfc == NRF_UARTE_HWFC_ENABLED) && (!p_config->skip_gpio_cfg))
    {
        p_cb->flags |= UARTE_FLAG_HWFC_PINS;
        if (p_config->cts_pin != NRF_UARTE_PSEL_DISCONNECTED)
        {
            nrfy_gpio_cfg_input(p_config->cts_pin, NRF_GPIO_PIN_NOPULL);
        }
        if (p_config->rts_pin != NRF_UARTE_PSEL_DISCONNECTED)
        {
            nrfy_gpio_pin_set(p_config->rts_pin);
            nrfy_gpio_cfg_output(p_config->rts_pin);
        }
    }

    if (!NRFX_IS_ENABLED(NRFX_UARTE_CONFIG_SKIP_PSEL_CONFIG) && !p_config->skip_psel_cfg)
    {
        p_cb->flags |= UARTE_FLAG_PSEL_UNINIT;
    }

    nrfy_uarte_config_t nrfy_config =
    {
        .pins =
        {
            .txd_pin = p_config->txd_pin,
            .rxd_pin = p_config->rxd_pin,
            .rts_pin = p_config->rts_pin,
            .cts_pin = p_config->cts_pin
        },
        .skip_psel_cfg = NRFX_IS_ENABLED(NRFX_UARTE_CONFIG_SKIP_PSEL_CONFIG) ?
            true : p_config->skip_psel_cfg
    };
    nrfy_config.config = p_config->config;

#if defined(LUMOS_XXAA)
    uint32_t base_frequency = NRF_UARTE_BASE_FREQUENCY_GET(p_instance->p_reg);
    if (base_frequency != NRF_UARTE_BASE_FREQUENCY_16MHZ)
    {
        uint32_t baudrate_factor = base_frequency / NRF_UARTE_BASE_FREQUENCY_16MHZ;
        nrfy_config.baudrate =
            (nrf_uarte_baudrate_t)((uint32_t)p_config->baudrate / baudrate_factor);
    }
    else
#endif
    {
        nrfy_config.baudrate = p_config->baudrate;
    }

    nrfy_uarte_periph_configure(p_instance->p_reg, &nrfy_config);

    apply_workaround_for_enable_anomaly(p_instance);

    nrfy_uarte_int_init(p_instance->p_reg,
                        NRFY_EVENT_TO_INT_BITMASK(NRF_UARTE_EVENT_ENDRX) |
                        NRFY_EVENT_TO_INT_BITMASK(NRF_UARTE_EVENT_ENDTX) |
                        NRFY_EVENT_TO_INT_BITMASK(NRF_UARTE_EVENT_ERROR) |
                        NRFY_EVENT_TO_INT_BITMASK(NRF_UARTE_EVENT_RXTO)  |
                        NRFY_EVENT_TO_INT_BITMASK(NRF_UARTE_EVENT_TXSTOPPED),
                        p_config->interrupt_priority,
                        false);
}

static void pins_to_default(nrfx_uarte_t const * p_instance)
{
    uarte_control_block_t const * p_cb = &m_cb[p_instance->drv_inst_idx];
    nrfy_uarte_pins_t pins;

    // Need to read pins before they are reset.
    if (!NRFX_IS_ENABLED(NRFX_UARTE_CONFIG_SKIP_GPIO_CONFIG))
    {
        nrfy_uarte_pins_get(p_instance->p_reg, &pins);
    }

    // Reset pins to default states.
    if (!NRFX_IS_ENABLED(NRFX_UARTE_CONFIG_SKIP_PSEL_CONFIG) &&
        (p_cb->flags & UARTE_FLAG_PSEL_UNINIT))
    {
        nrfy_uarte_pins_disconnect(p_instance->p_reg);
    }

    if (!NRFX_IS_ENABLED(NRFX_UARTE_CONFIG_SKIP_GPIO_CONFIG))
    {
        if (p_cb->flags & UARTE_FLAG_GPIO_UNINIT)
        {
            if (pins.txd_pin != NRF_UARTE_PSEL_DISCONNECTED)
            {
                nrfy_gpio_cfg_default(pins.txd_pin);
            }
            if (pins.rxd_pin != NRF_UARTE_PSEL_DISCONNECTED)
            {
                nrfy_gpio_cfg_default(pins.rxd_pin);
            }

            if (p_cb->flags & UARTE_FLAG_HWFC_PINS)
            {
                if (pins.cts_pin != NRF_UARTE_PSEL_DISCONNECTED)
                {
                    nrfy_gpio_cfg_default(pins.cts_pin);
                }
                if (pins.rts_pin != NRF_UARTE_PSEL_DISCONNECTED)
                {
                    nrfy_gpio_cfg_default(pins.rts_pin);
                }
            }
        }
    }
}

static void apply_workaround_for_enable_anomaly(nrfx_uarte_t const * p_instance)
{
#if defined(NRF53_SERIES) || defined(NRF91_SERIES)
    // Apply workaround for anomalies:
    // - nRF91 - anomaly 23
    // - nRF53 - anomaly 44
    volatile uint32_t const * rxenable_reg =
        (volatile uint32_t *)(((uint32_t)p_instance->p_reg) + 0x564);
    volatile uint32_t const * txenable_reg =
        (volatile uint32_t *)(((uint32_t)p_instance->p_reg) + 0x568);

    if (*txenable_reg == 1)
    {
        nrfy_uarte_task_trigger(p_instance->p_reg, NRF_UARTE_TASK_STOPTX);
    }

    if (*rxenable_reg == 1)
    {
        nrfy_uarte_enable(p_instance->p_reg);
        nrfy_uarte_task_trigger(p_instance->p_reg, NRF_UARTE_TASK_STOPRX);

        bool workaround_succeded;
        // The UARTE is able to receive up to four bytes after the STOPRX task has been triggered.
        // On lowest supported baud rate (1200 baud), with parity bit and two stop bits configured
        // (resulting in 12 bits per data byte sent), this may take up to 40 ms.
        NRFX_WAIT_FOR(*rxenable_reg == 0, 40000, 1, workaround_succeded);
        if (!workaround_succeded)
        {
            NRFX_LOG_ERROR("Failed to apply workaround for instance with base address: %p.",
                           (void *)p_instance->p_reg);
        }

        (void)nrfy_uarte_errorsrc_get_and_clear(p_instance->p_reg);
        nrfy_uarte_disable(p_instance->p_reg);
    }
#else
    (void)(p_instance);
#endif // defined(NRF53_SERIES) || defined(NRF91_SERIES)
}

static uint32_t uarte_int_lock(NRF_UARTE_Type * p_uarte)
{
    uint32_t int_enabled = nrfy_uarte_int_enable_check(p_uarte, UINT32_MAX);

    nrfy_uarte_int_disable(p_uarte, int_enabled);

    return int_enabled;
}

