guangli2015/freertos_nRF54l15/Source/nrfx/drivers/src/nrfx_uarte.c
static void uarte_int_unlock(NRF_UARTE_Type * p_uarte, uint32_t int_mask)
{
    nrfy_uarte_int_enable(p_uarte, int_mask);
}

/* Function returns true if new transfer can be started. Since TXSTOPPED
 * (and ENDTX) is cleared before triggering new transfer, TX is ready for new
 * transfer if any event is set.
 *
 * @param stop_on_end TXSTOP is PPIed with ENDTX. Check only TXSTOPPED.
 */
static bool is_tx_ready(NRF_UARTE_Type * p_uarte, bool stop_on_end)
{
    return nrfy_uarte_event_check(p_uarte, NRF_UARTE_EVENT_TXSTOPPED) ||
        (!stop_on_end && nrfy_uarte_event_check(p_uarte, NRF_UARTE_EVENT_ENDTX));
}

static bool prepare_rx(NRF_UARTE_Type * p_uarte)
{
    /**
     * Stop any currently running RX operations. This can occur when a
     * bootloader sets up the UART hardware and does not clean it up
     * before jumping to the next application.
     */
    if (nrfy_uarte_event_check(p_uarte, NRF_UARTE_EVENT_RXSTARTED))
    {
        bool res;

        nrfy_uarte_enable(p_uarte);
        nrfy_uarte_task_trigger(p_uarte, NRF_UARTE_TASK_STOPRX);

        NRFX_WAIT_FOR(nrfy_uarte_event_check(p_uarte, NRF_UARTE_EVENT_RXTO) ||
                      nrfy_uarte_event_check(p_uarte, NRF_UARTE_EVENT_ERROR), 100, 10, res);

        nrfy_uarte_event_clear(p_uarte, NRF_UARTE_EVENT_RXSTARTED);
        nrfy_uarte_event_clear(p_uarte, NRF_UARTE_EVENT_ENDRX);
        nrfy_uarte_event_clear(p_uarte, NRF_UARTE_EVENT_RXTO);
        nrfy_uarte_disable(p_uarte);

        return res;
    }
    return true;
}

static bool prepare_tx(NRF_UARTE_Type * p_uarte, bool stop_on_end)
{
    (void)stop_on_end;
    uint8_t dummy = 0;

    nrfy_uarte_enable(p_uarte);

    /* Set TXSTOPPED event by requesting fake (zero-length) transfer.
     * Pointer to RAM variable (data->tx_buffer) is set because otherwise
     * such operation may result in HardFault or RAM corruption.
     */
    nrfy_uarte_tx_buffer_set(p_uarte, &dummy, 0);
    nrfy_uarte_task_trigger(p_uarte, NRF_UARTE_TASK_STARTTX);

    /* switch off transmitter to save an energy */
    nrfy_uarte_task_trigger(p_uarte, NRF_UARTE_TASK_STOPTX);

    bool res;

    NRFX_WAIT_FOR(is_tx_ready(p_uarte, true), 10, 1, res);

    if (!res)
    {
        return false;
    }

    nrfy_uarte_event_clear(p_uarte, NRF_UARTE_EVENT_ENDTX);
    nrfy_uarte_disable(p_uarte);
    return true;
}

nrfx_err_t nrfx_uarte_init(nrfx_uarte_t const *        p_instance,
                           nrfx_uarte_config_t const * p_config,
                           nrfx_uarte_event_handler_t  event_handler)
{
    NRFX_ASSERT(p_config);
    uint32_t inst_idx = p_instance->drv_inst_idx;
    uarte_control_block_t * p_cb = &m_cb[inst_idx];
    nrfx_err_t err_code;

    if (p_cb->state != NRFX_DRV_STATE_UNINITIALIZED)
    {
#if NRFX_API_VER_AT_LEAST(3, 2, 0)
        err_code = NRFX_ERROR_ALREADY;
#else
        err_code = NRFX_ERROR_INVALID_STATE;
#endif
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }

#if NRFX_CHECK(NRFX_PRS_ENABLED)
    static nrfx_irq_handler_t const irq_handlers[NRFX_UARTE_ENABLED_COUNT] = {
        NRFX_INSTANCE_IRQ_HANDLERS_LIST(UARTE, uarte)
    };
    if (nrfx_prs_acquire(p_instance->p_reg, irq_handlers[inst_idx]) != NRFX_SUCCESS)
    {
        err_code = NRFX_ERROR_BUSY;
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }
#endif // NRFX_CHECK(NRFX_PRS_ENABLED)

    memset(p_cb, 0, sizeof(uarte_control_block_t));

    p_cb->p_context = p_config->p_context;
    p_cb->tx.cache.p_buffer = p_config->tx_cache.p_buffer;
    if (p_config->tx_cache.length == 0)
    {
        p_cb->tx.cache.length = 0;
    }
    else
    {
        p_cb->tx.cache.length = p_config->tx_cache.length - 1;
    }
    if (p_config->rx_cache.length >= UARTE_HW_RX_FIFO_SIZE)
    {
        p_cb->rx.flush.p_buffer = p_config->rx_cache.p_buffer;
        p_cb->rx.flush.length = 0;
        if (RX_CACHE_SUPPORTED && p_config->p_rx_cache_scratch)
        {
            if (p_config->rx_cache.length < (UARTE_HW_RX_FIFO_SIZE + MIN_RX_CACHE_SIZE))
            {
                return NRFX_ERROR_INVALID_PARAM;
            }
            size_t cache_len = p_config->rx_cache.length - UARTE_HW_RX_FIFO_SIZE;
            size_t buf_len = cache_len / 2;

            p_cb->rx.p_cache = p_config->p_rx_cache_scratch;

            memset(p_cb->rx.p_cache, 0, sizeof(*p_cb->rx.p_cache));
            // Split provided cache space into two equal buffers. Cache buffers can overlap with
            // flush buffer as they are not used simultaneously.
            p_cb->rx.p_cache->cache_len = buf_len;
            p_cb->rx.p_cache->cache[0].p_buffer =
                &p_config->rx_cache.p_buffer[UARTE_HW_RX_FIFO_SIZE];
            p_cb->rx.p_cache->cache[1].p_buffer =
                &p_config->rx_cache.p_buffer[UARTE_HW_RX_FIFO_SIZE + buf_len];
        }
    }

#if NRF_UARTE_HAS_ENDTX_STOPTX_SHORT
    uint32_t tx_int_mask = 0;

    nrfy_uarte_shorts_enable(p_instance->p_reg, NRF_UARTE_SHORT_ENDTX_STOPTX);
#else
    uint32_t tx_int_mask = (!event_handler || p_config->tx_stop_on_end) ?
                               0 : NRF_UARTE_INT_ENDTX_MASK;

    if (p_config->tx_stop_on_end)
    {
        p_cb->flags |= UARTE_FLAG_TX_STOP_ON_END;
    }
#endif

    p_cb->handler = event_handler;
    p_cb->state   = NRFX_DRV_STATE_INITIALIZED;

    // Handle case when other user (e.g. bootloader) left RX in active state.
    if (!prepare_rx(p_instance->p_reg))
    {
#if NRFX_CHECK(NRFX_PRS_ENABLED)
        nrfx_prs_release(p_instance->p_reg);
#endif
        return NRFX_ERROR_INTERNAL;
    }

    uarte_configure(p_instance, p_config);

    if (!prepare_tx(p_instance->p_reg, p_config->tx_stop_on_end))
    {
#if NRFX_CHECK(NRFX_PRS_ENABLED)
        nrfx_prs_release(p_instance->p_reg);
#endif
        return NRFX_ERROR_INTERNAL;
    }

    uint32_t int_mask = tx_int_mask | ((event_handler) ? rx_int_mask : 0);

    nrfy_uarte_int_enable(p_instance->p_reg, int_mask);

    return NRFX_SUCCESS;
}

nrfx_err_t nrfx_uarte_reconfigure(nrfx_uarte_t const *        p_instance,
                                  nrfx_uarte_config_t const * p_config)
{
    NRFX_ASSERT(p_config);

