guangli2015/freertos_nRF54l15/Source/nrfx/drivers/src/nrfx_uarte.c
    uarte_control_block_t * p_cb = &m_cb[p_instance->drv_inst_idx];

    if (p_cb->state == NRFX_DRV_STATE_UNINITIALIZED)
    {
        return NRFX_ERROR_INVALID_STATE;
    }
    if (nrfx_uarte_tx_in_progress(p_instance))
    {
        return NRFX_ERROR_BUSY;
    }
    nrfy_uarte_disable(p_instance->p_reg);
    if (p_cb->handler)
    {
        p_cb->p_context = p_config->p_context;
    }
    uarte_configure(p_instance, p_config);

    if (prepare_tx(p_instance->p_reg, p_cb->flags & UARTE_FLAG_TX_STOP_ON_END))
    {
        return NRFX_SUCCESS;
    }
    else
    {
        return NRFX_ERROR_INTERNAL;
    }
}

void nrfx_uarte_uninit(nrfx_uarte_t const * p_instance)
{
    nrfx_err_t err;
    uarte_control_block_t * p_cb = &m_cb[p_instance->drv_inst_idx];
    NRF_UARTE_Type * p_uarte = p_instance->p_reg;

    NRFX_ASSERT(p_cb->state != NRFX_DRV_STATE_UNINITIALIZED);

    nrfy_uarte_int_disable(p_uarte,
                           NRF_UARTE_INT_ENDRX_MASK |
                           NRF_UARTE_INT_ENDTX_MASK |
                           NRF_UARTE_INT_ERROR_MASK |
                           NRF_UARTE_INT_RXTO_MASK  |
                           NRF_UARTE_INT_RXSTARTED_MASK  |
                           NRF_UARTE_INT_TXSTOPPED_MASK);
    nrfy_uarte_int_uninit(p_uarte);

#if NRF_UARTE_HAS_ENDTX_STOPTX_SHORT
    nrfy_uarte_shorts_disable(p_uarte, NRF_UARTE_SHORT_ENDTX_STOPTX);
#endif

#if NRFX_CHECK(NRFX_PRS_ENABLED)
    nrfx_prs_release(p_uarte);
#endif

    err = nrfx_uarte_rx_abort(p_instance, true, true);
    (void)err;

    err = nrfx_uarte_tx_abort(p_instance, true);
    (void)err;

    pins_to_default(p_instance);

    p_cb->flags   = 0;
    p_cb->state   = NRFX_DRV_STATE_UNINITIALIZED;
    p_cb->handler = NULL;
    NRFX_LOG_INFO("Instance uninitialized: %d.", p_instance->drv_inst_idx);
}

bool nrfx_uarte_init_check(nrfx_uarte_t const * p_instance)
{
    uarte_control_block_t * p_cb = &m_cb[p_instance->drv_inst_idx];

    return (p_cb->state != NRFX_DRV_STATE_UNINITIALIZED);
}

static void tx_start(NRF_UARTE_Type * p_uarte, const uint8_t *buf, size_t len, bool en_int)
{
    nrfy_uarte_tx_buffer_set(p_uarte, buf, len);
    nrfy_uarte_event_clear(p_uarte, NRF_UARTE_EVENT_ENDTX);
    nrfy_uarte_event_clear(p_uarte, NRF_UARTE_EVENT_TXSTOPPED);
    nrfy_uarte_event_clear(p_uarte, NRF_UARTE_EVENT_TXSTARTED);

    nrfy_uarte_enable(p_uarte);

    if (en_int)
    {
        nrfy_uarte_int_enable(p_uarte, NRF_UARTE_INT_TXSTOPPED_MASK);
    }

    nrfy_uarte_task_trigger(p_uarte, NRF_UARTE_TASK_STARTTX);
}

static bool is_rx_active(uarte_control_block_t * p_cb)
{
    return (p_cb->flags & UARTE_FLAG_RX_ENABLED) ? true : false;
}

/* Must be called with interrupts locked. */
static void disable_hw_from_tx(NRF_UARTE_Type *        p_uarte,
                                  uarte_control_block_t * p_cb)
{
    if (nrfy_uarte_event_check(p_uarte, NRF_UARTE_EVENT_TXSTOPPED) && !is_rx_active(p_cb))
    {
        nrfy_uarte_disable(p_uarte);
    }
}

/* Block until transfer is completed. Disable UARTE if RX is not active. */
static void block_on_tx(NRF_UARTE_Type *        p_uarte,
                        uarte_control_block_t * p_cb)
{
    bool stop_on_end = p_cb->flags & UARTE_FLAG_TX_STOP_ON_END;
    bool do_disable = true;

    while (!is_tx_ready(p_uarte, stop_on_end))
    {}

    NRFX_CRITICAL_SECTION_ENTER();

    if (!stop_on_end)
    {
        if (nrfy_uarte_event_check(p_uarte, NRF_UARTE_EVENT_ENDTX))
        {
            nrfy_uarte_task_trigger(p_uarte, NRF_UARTE_TASK_STOPTX);
            while (!is_tx_ready(p_uarte, true))
            {}
        }
        else
        {
            do_disable = false;
        }
    }
    else if (!nrfy_uarte_event_check(p_uarte, NRF_UARTE_EVENT_TXSTOPPED))
    {
        do_disable = false;
    }

    if (do_disable)
    {
        disable_hw_from_tx(p_uarte, p_cb);
    }
    NRFX_CRITICAL_SECTION_EXIT();
}

static nrfx_err_t wait_for_endtx(NRF_UARTE_Type * p_uarte,
                                 uint8_t const *  p_buf,
                                 uint32_t         length,
                                 bool             stop_on_end)
{
    const uint8_t * p_tx;
    bool ready;
    uint32_t amount;
    nrfx_err_t err;

    do {
            // Pend until TX is ready again or TX buffer pointer is replaced with new
            // address which indicates that current context got preempted and new
            // request was started from a higher priority context.
            ready = is_tx_ready(p_uarte, stop_on_end);
            amount = nrfy_uarte_tx_amount_get(p_uarte);
            p_tx = nrfy_uarte_tx_buffer_get(p_uarte);

            if (ready || (p_tx != p_buf))
            {
                break;
            }
#if defined(CONFIG_SOC_SERIES_BSIM_NRFXX)
            nrfx_coredep_delay_us(3);
#endif
    } while (true);

    // Check if transfer got aborted. Note that aborted transfer can only be
    // detected if new transfer is not started.
    err = ((p_tx == p_buf) && (length > amount)) ? NRFX_ERROR_FORBIDDEN : NRFX_SUCCESS;

    if ((err == NRFX_SUCCESS) && !stop_on_end)
    {
        nrfy_uarte_task_trigger(p_uarte, NRF_UARTE_TASK_STOPTX);
    }

    return err;
}

static nrfx_err_t poll_out(nrfx_uarte_t const * p_instance, uint8_t const * p_byte, bool early_ret)
{
    uarte_control_block_t * p_cb = &m_cb[p_instance->drv_inst_idx];
    NRF_UARTE_Type * p_uarte = p_instance->p_reg;
    NRFX_ASSERT(p_cb->state == NRFX_DRV_STATE_INITIALIZED);
    bool use_cache;
    nrfx_err_t err = NRFX_ERROR_BUSY;
    uint8_t const * p_buf;

    if (p_cb->tx.cache.p_buffer == NULL)
    {
        if (!nrf_dma_accessible_check(p_uarte, p_byte))
        {
            return NRFX_ERROR_INVALID_PARAM;
        }
        use_cache = false;
    }
    else
    {
        use_cache = true;
    }

    NRFX_CRITICAL_SECTION_ENTER();
    bool tx_ready = is_tx_ready(p_uarte, p_cb->flags & UARTE_FLAG_TX_STOP_ON_END);

    if (tx_ready)
    {
        if (p_cb->tx.amount < 0)
        {
            p_cb->tx.amount = (int)nrfy_uarte_tx_amount_get(p_uarte);
        }
        if (use_cache)
        {
            // Last byte in cache buffer is used for polling out.
            p_cb->tx.cache.p_buffer[p_cb->tx.cache.length] = *p_byte;
            p_buf = &p_cb->tx.cache.p_buffer[p_cb->tx.cache.length];
        }
        else
        {
            p_buf = p_byte;
        }
        tx_start(p_uarte, p_buf, 1, early_ret);
        err = NRFX_SUCCESS;
    }
    NRFX_CRITICAL_SECTION_EXIT();

    if ((err == NRFX_SUCCESS) && !early_ret)
    {
        err = wait_for_endtx(p_uarte, p_buf, 1, p_cb->flags & UARTE_FLAG_TX_STOP_ON_END);

        NRFX_CRITICAL_SECTION_ENTER();
        disable_hw_from_tx(p_uarte, p_cb);
        NRFX_CRITICAL_SECTION_EXIT();
    }

