guangli2015/freertos_nRF54l15/Source/nrfx/drivers/src/nrfx_uarte.c
    return err;
}

static bool tx_prepare_start(NRF_UARTE_Type *        p_uarte,
                             uarte_control_block_t * p_cb,
                             bool                    use_cache)
{
    if (!is_tx_ready(p_uarte, p_cb->flags & UARTE_FLAG_TX_STOP_ON_END))
    {
        // Transmitter is busy, set pending flag.
        p_cb->flags |= UARTE_FLAG_TX_PENDING;
        nrfy_uarte_int_enable(p_uarte, NRF_UARTE_INT_TXSTOPPED_MASK);
        return false;
    }

    uint8_t const * p_buf;
    uint32_t xfer_len;

    if (use_cache)
    {
        uint32_t chunk_len = NRFX_MIN(p_cb->tx.cache.length, p_cb->tx.curr.length - p_cb->tx.off);

        memcpy(p_cb->tx.cache.p_buffer, &p_cb->tx.curr.p_buffer[p_cb->tx.off], chunk_len);
        p_buf = p_cb->tx.cache.p_buffer;
        xfer_len = chunk_len;
    }
    else
    {
        p_buf = p_cb->tx.curr.p_buffer;
        xfer_len = p_cb->tx.curr.length;
    }
    p_cb->tx.amount = -1;
    tx_start(p_uarte, p_buf, xfer_len, true);

    return true;
}

static nrfx_err_t blocking_tx(nrfx_uarte_t const * p_instance,
                              uint8_t const *      p_buffer,
                              uint32_t             length,
                              uint32_t             flags)
{
    uarte_control_block_t * p_cb = &m_cb[p_instance->drv_inst_idx];
    bool early_ret = p_cb->handler && (flags & NRFX_UARTE_TX_EARLY_RETURN);
    nrfx_err_t err = NRFX_SUCCESS;

    if ((early_ret && !p_cb->tx.cache.p_buffer) || (p_cb->flags & UARTE_FLAG_TX_LINKED))
    {
        return NRFX_ERROR_FORBIDDEN;
    }

    for (uint32_t i = 0; i < length; i++)
    {
        do {
            err = poll_out(p_instance, &p_buffer[i], early_ret);
            if (err == NRFX_SUCCESS)
            {
                break;
            }
            if (err != NRFX_ERROR_BUSY)
            {
                // TX aborted or other error
                return err;
            }
#if defined(CONFIG_SOC_SERIES_BSIM_NRFXX)
            nrfx_coredep_delay_us(3);
#endif
        } while (true);

        if (!p_cb->handler && (p_cb->flags & UARTE_FLAG_TX_ABORTED))
        {
            NRFX_ATOMIC_FETCH_AND(&p_cb->flags, ~UARTE_FLAG_TX_ABORTED);
            err = NRFX_ERROR_FORBIDDEN;
            break;
        }
    }
    return err;
}

nrfx_err_t nrfx_uarte_tx(nrfx_uarte_t const * p_instance,
                         uint8_t const *      p_data,
                         size_t               length,
                         uint32_t             flags)
{
    uarte_control_block_t * p_cb = &m_cb[p_instance->drv_inst_idx];
    NRF_UARTE_Type * p_uarte = p_instance->p_reg;

    NRFX_ASSERT(p_cb->state == NRFX_DRV_STATE_INITIALIZED);
    NRFX_ASSERT(UARTE_LENGTH_VALIDATE(p_instance->drv_inst_idx, length));
    NRFX_ASSERT(p_data);
    NRFX_ASSERT(length > 0);

    nrfx_err_t err_code = NRFX_SUCCESS;
    bool use_cache;

    if (length == 0)
    {
        return NRFX_ERROR_INVALID_LENGTH;
    }

    if (!p_cb->handler && (flags == 0))
    {
        if (p_cb->tx.curr.length == 0)
        {
            p_cb->tx.curr.length = length;
        }
        else
        {
            return NRFX_ERROR_BUSY;
        }

        err_code = blocking_tx(p_instance, p_data, length, 0);
        p_cb->tx.curr.length = 0;
        return err_code;
    }

    // Handle case when transfer is blocking.
    if (flags & (NRFX_UARTE_TX_EARLY_RETURN | NRFX_UARTE_TX_BLOCKING))
    {
        return blocking_tx(p_instance, p_data, length, flags);
    }

    // EasyDMA requires that transfer buffers are placed in DataRAM,
    // signal error if the are not.
    if (!nrf_dma_accessible_check(p_uarte, p_data))
    {
        if (!p_cb->tx.cache.p_buffer ||
            (NRFX_IS_ENABLED(NRFX_UARTE_CONFIG_TX_LINK) && (flags & NRFX_UARTE_TX_LINK)))
        {
            err_code = NRFX_ERROR_INVALID_ADDR;
        }

        use_cache = true;
    }
    else
    {
        if ((p_cb->flags & UARTE_FLAG_TX_STOP_ON_END) &&
            (NRFX_IS_ENABLED(NRFX_UARTE_CONFIG_TX_LINK) && (flags & NRFX_UARTE_TX_LINK)))
        {
            // STOPTX on ENDTX connection cannot be used together with linking.
            err_code = NRFX_ERROR_FORBIDDEN;
        }

        use_cache = false;
    }

    if (err_code != NRFX_SUCCESS)
    {
        return err_code;
    }

    NRFX_CRITICAL_SECTION_ENTER();
    if (p_cb->tx.curr.length == 0)
    {
        p_cb->tx.curr.length = length;

#if defined(__GNUC__)
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wcast-qual"
#endif

        p_cb->tx.curr.p_buffer = (uint8_t *)p_data;

#if defined(__GNUC__)
#pragma GCC diagnostic pop
#endif

        if (use_cache)
        {
            p_cb->flags |= UARTE_FLAG_TX_USE_CACHE;
        }

        tx_prepare_start(p_uarte, p_cb, use_cache);
    }
    else if (NRFX_IS_ENABLED(NRFX_UARTE_CONFIG_TX_LINK) &&
             !p_cb->tx.next.length && (flags & NRFX_UARTE_TX_LINK))
    {
        if (nrf_dma_accessible_check(p_uarte, p_cb->tx.curr.p_buffer))
        {
            bool res;

            p_cb->flags |= UARTE_FLAG_TX_LINKED;

#if defined(__GNUC__)
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wcast-qual"
#endif

            p_cb->tx.next.p_buffer = (uint8_t *)p_data;

#if defined(__GNUC__)
#pragma GCC diagnostic pop
#endif

            p_cb->tx.next.length = length;
            NRFX_WAIT_FOR(nrfy_uarte_event_check(p_uarte, NRF_UARTE_EVENT_TXSTARTED), 10, 1, res);
            if (res)
            {
#if NRF_UARTE_HAS_ENDTX_STOPTX_SHORT
                nrfy_uarte_int_enable(p_instance->p_reg, NRF_UARTE_INT_ENDTX_MASK);
                nrfy_uarte_shorts_disable(p_uarte, NRF_UARTE_SHORT_ENDTX_STOPTX);
#endif
                nrfy_uarte_event_clear(p_uarte, NRF_UARTE_EVENT_TXSTARTED);
                nrfy_uarte_tx_buffer_set(p_uarte, p_data, length);
                err_code = NRFX_SUCCESS;
            }
            else
            {
                err_code = NRFX_ERROR_INTERNAL;
            }
        }
        else
        {
            err_code = NRFX_ERROR_FORBIDDEN;
        }
    }
    else
    {
        err_code = NRFX_ERROR_BUSY;
    }
    NRFX_CRITICAL_SECTION_EXIT();

    return err_code;
}

bool nrfx_uarte_tx_in_progress(nrfx_uarte_t const * p_instance)
{
    NRFX_ASSERT(m_cb[p_instance->drv_inst_idx].state != NRFX_DRV_STATE_UNINITIALIZED);

