guangli2015/freertos_nRF54l15/Source/nrfx/drivers/src/nrfx_uarte.c
    return (m_cb[p_instance->drv_inst_idx].tx.curr.length != 0);
}

nrfx_err_t nrfx_uarte_tx_abort(nrfx_uarte_t const * p_instance, bool sync)
{
    uarte_control_block_t * p_cb = &m_cb[p_instance->drv_inst_idx];
    NRF_UARTE_Type * p_uarte = p_instance->p_reg;
    uint32_t int_mask;

    int_mask = uarte_int_lock(p_uarte);
    if (p_cb->tx.curr.length == 0)
    {
        uarte_int_unlock(p_uarte, int_mask);
        return NRFX_ERROR_INVALID_STATE;
    }

    NRFX_ATOMIC_FETCH_OR(&p_cb->flags, UARTE_FLAG_TX_ABORTED);

    nrfy_uarte_task_trigger(p_uarte, NRF_UARTE_TASK_STOPTX);

    if (sync)
    {
        block_on_tx(p_uarte, p_cb);
        nrfy_uarte_event_clear(p_uarte, NRF_UARTE_EVENT_ENDTX);
        p_cb->tx.curr.length = 0;
    }

    uarte_int_unlock(p_uarte, int_mask);

    NRFX_LOG_INFO("TX transaction aborted.");

    return NRFX_SUCCESS;
}

static void user_handler(uarte_control_block_t * p_cb, nrfx_uarte_evt_type_t type)
{
    nrfx_uarte_event_t event = {
        .type = type
    };

    p_cb->handler(&event, p_cb->p_context);
}

static void user_handler_on_rx_disabled(uarte_control_block_t * p_cb, size_t flush_cnt)
{
    nrfx_uarte_event_t event = {
        .type = NRFX_UARTE_EVT_RX_DISABLED,
        .data = {
            .rx_disabled = {
                .flush_cnt = flush_cnt
            }
        }
    };

    p_cb->handler(&event, p_cb->p_context);
}

static void user_handler_on_error(NRF_UARTE_Type * p_uarte, uarte_control_block_t * p_cb)
{
    nrfx_uarte_event_t event = {
        .type = NRFX_UARTE_EVT_ERROR,
        .data = {
            .error = {
                .error_mask = nrfy_uarte_errorsrc_get_and_clear(p_uarte)
            }
        }
    };

    p_cb->handler(&event, p_cb->p_context);
}

static void user_handler_on_rx_done(uarte_control_block_t * p_cb,
                                    const uint8_t *         p_data,
                                    size_t                  len)
{
#if defined(__GNUC__)
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wcast-qual"
#endif

    nrfx_uarte_event_t event = {
        .type = NRFX_UARTE_EVT_RX_DONE,
        .data = {
            .rx = {
                .p_buffer = (uint8_t *)p_data,
                .length = len
            }
        }
    };

#if defined(__GNUC__)
#pragma GCC diagnostic pop
#endif

    p_cb->handler(&event, p_cb->p_context);
}

static void user_handler_on_tx_done(uarte_control_block_t * p_cb,
                                    const uint8_t *         p_data,
                                    size_t                  len,
                                    bool                    abort)
{
#if defined(__GNUC__)
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wcast-qual"
#endif

    nrfx_uarte_event_t event = {
        .type = NRFX_UARTE_EVT_TX_DONE,
        .data = {
            .tx = {
                .p_buffer = (uint8_t *)p_data,
                .length = len,
                .flags = abort ? NRFX_UARTE_TX_DONE_ABORTED : 0
            }
        }
    };

#if defined(__GNUC__)
#pragma GCC diagnostic pop
#endif

    p_cb->handler(&event, p_cb->p_context);
}

static void release_rx(uarte_control_block_t * p_cb)
{
    /* Clear all RX flags. */
    NRFX_ATOMIC_FETCH_AND(&p_cb->flags, ~UARTE_RX_FLAGS);
}

static bool is_tx_active(NRF_UARTE_Type * p_uarte)
{
    return !nrfy_uarte_event_check(p_uarte, NRF_UARTE_EVENT_TXSTOPPED) ||
        nrfy_uarte_int_enable_check(p_uarte, NRF_UARTE_INT_TXSTOPPED_MASK);
}

static void disable_hw_from_rx(NRF_UARTE_Type * p_uarte)
{
    NRFX_CRITICAL_SECTION_ENTER();

    if (!is_tx_active(p_uarte))
    {
        nrfy_uarte_disable(p_uarte);
    }

    NRFX_CRITICAL_SECTION_EXIT();
}

static void on_rx_disabled(NRF_UARTE_Type        * p_uarte,
                           uarte_control_block_t * p_cb,
                           size_t                  flush_cnt)
{
    nrfy_uarte_event_clear(p_uarte, NRF_UARTE_EVENT_RXDRDY);
    nrfy_uarte_shorts_disable(p_uarte, NRF_UARTE_SHORT_ENDRX_STARTRX);
    nrfy_uarte_int_disable(p_uarte, rx_int_mask);
    disable_hw_from_rx(p_uarte);

    p_cb->rx.curr.p_buffer = NULL;
    p_cb->rx.next.p_buffer = NULL;
    release_rx(p_cb);
    user_handler_on_rx_disabled(p_cb, flush_cnt);
}

static void handler_on_rx_done(uarte_control_block_t * p_cb,
                               uint8_t *               p_data,
                               size_t                  len,
                               bool                    abort)
{
    bool cache_used = RX_CACHE_SUPPORTED && (p_cb->flags & UARTE_FLAG_RX_USE_CACHE);
    nrfx_uarte_rx_cache_t * p_cache = p_cb->rx.p_cache;

    if (!cache_used)
    {
        user_handler_on_rx_done(p_cb, p_data, len);
        return;
    }
    else if (!p_cache->user[0].p_buffer)
    {
        return;
    }

    memcpy(&p_cache->user[0].p_buffer[p_cache->received], p_data, len);
    p_cache->received += len;

    bool user_buf_end = p_cache->user[0].length == p_cache->received;

    if (user_buf_end || abort)
    {
        uint8_t *p_buf = p_cache->user[0].p_buffer;
        size_t buf_len = p_cache->received;

        p_cache->received = 0;
        p_cache->user[0] = p_cache->user[1];
        p_cache->user[1] = (nrfy_uarte_buffer_t){ NULL, 0 };
        if (p_cache->user[0].length)
        {
            p_cache->buf_req = true;
        }
        user_handler_on_rx_done(p_cb, p_buf, buf_len);
    }
}

/* Some data may be left in flush buffer. It need to be copied into rx buffer.
 * If flushed data exceeds input buffer rx enabled is terminated.
 * Returns true when flushed did not filled whole user buffer.
 */
static bool rx_flushed_handler(NRF_UARTE_Type * p_uarte, uarte_control_block_t * p_cb)
{
    if (p_cb->rx.flush.length == 0)
    {
        return true;
    }

    if ((uint32_t)p_cb->rx.flush.length >= p_cb->rx.curr.length)
    {
        uint8_t * p_buf = p_cb->rx.curr.p_buffer;
        size_t len = p_cb->rx.curr.length;

        p_cb->rx.curr.p_buffer = NULL;
        p_cb->rx.curr.length = 0;
        memcpy(p_buf, p_cb->rx.flush.p_buffer, len);
        p_cb->rx.flush.length -= len;
        memmove(p_cb->rx.flush.p_buffer, &p_cb->rx.flush.p_buffer[len], p_cb->rx.flush.length);

        if (p_cb->handler)
        {
            bool stop_on_end = p_cb->flags & UARTE_FLAG_RX_STOP_ON_END;

            if (stop_on_end)
            {
                NRFX_ATOMIC_FETCH_OR(&p_cb->flags, UARTE_FLAG_RX_ABORTED);
            }

