guangli2015/freertos_nRF54l15/Source/nrfx/drivers/src/nrfx_uarte.c
            handler_on_rx_done(p_cb, p_buf, len, false);
            if (stop_on_end)
            {
                    on_rx_disabled(p_uarte, p_cb, 0);
            }
        }

        return false;
    }
    else
    {
        memcpy(p_cb->rx.curr.p_buffer, p_cb->rx.flush.p_buffer, p_cb->rx.flush.length);
        p_cb->rx.off = p_cb->rx.flush.length;
        p_cb->rx.flush.length = 0;
        NRFX_ATOMIC_FETCH_OR(&p_cb->flags, UARTE_FLAG_RX_FROM_FLUSH);
    }

    return true;
}

nrfx_err_t nrfx_uarte_rx_enable(nrfx_uarte_t const * p_instance, uint32_t flags)
{
    uarte_control_block_t * p_cb = &m_cb[p_instance->drv_inst_idx];
    NRF_UARTE_Type * p_uarte = p_instance->p_reg;
    uint32_t prev_flags;

    prev_flags = NRFX_ATOMIC_FETCH_OR(&p_cb->flags, UARTE_FLAG_RX_ENABLED);
    if (prev_flags & UARTE_FLAG_RX_ENABLED)
    {
        return NRFX_ERROR_BUSY;
    }

    if ((flags & NRFX_UARTE_RX_ENABLE_KEEP_FIFO_CONTENT) && !p_cb->rx.flush.p_buffer)
    {
        return NRFX_ERROR_FORBIDDEN;
    }

    nrfy_uarte_int_disable(p_uarte, rx_int_mask);
    nrfy_uarte_enable(p_uarte);
    nrfy_uarte_event_clear(p_uarte, NRF_UARTE_EVENT_ENDRX);
    nrfy_uarte_event_clear(p_uarte, NRF_UARTE_EVENT_RXSTARTED);
    nrfy_uarte_event_clear(p_uarte, NRF_UARTE_EVENT_RXTO);

    uint32_t rt_flags = (flags & NRFX_UARTE_RX_ENABLE_CONT ? UARTE_FLAG_RX_CONT : 0) |
                        (flags & NRFX_UARTE_RX_ENABLE_STOP_ON_END ? UARTE_FLAG_RX_STOP_ON_END : 0) |
                        (flags & NRFX_UARTE_RX_ENABLE_KEEP_FIFO_CONTENT ?
                                                UARTE_FLAG_RX_KEEP_FIFO_CONTENT : 0);

    NRFX_ATOMIC_FETCH_OR(&p_cb->flags, rt_flags);

    if ((p_cb->rx.curr.p_buffer == NULL) && p_cb->handler)
    {
        user_handler(p_cb, NRFX_UARTE_EVT_RX_BUF_REQUEST);
    }

    // Expecting to get buffer set as a response to the request.
    if (p_cb->rx.curr.p_buffer == NULL)
    {
        // If RX is not active then it means that reception is already stopped.
        // It may happen if RX flush had enough data to fill the user buffer.
        // In that case reception is disabled from the context of RX buffer set function.
        if (!is_rx_active(p_cb))
        {
            return NRFX_SUCCESS;
        }

        release_rx(p_cb);
        return NRFX_ERROR_NO_MEM;
    }

    if (nrfy_uarte_int_enable_check(p_uarte, NRF_UARTE_INT_RXDRDY_MASK) && p_cb->handler &&
        (p_cb->flags & UARTE_FLAG_RX_FROM_FLUSH))
    {
        NRFX_ATOMIC_FETCH_AND(&p_cb->flags, ~UARTE_FLAG_RX_FROM_FLUSH);
        user_handler(p_cb, NRFX_UARTE_EVT_RX_BYTE);
    }

    /* Check if instance is still enabled. It might get disabled at some point. */
    if (p_cb->flags & UARTE_FLAG_RX_ENABLED)
    {
        if (!nrfy_uarte_event_check(p_uarte, NRF_UARTE_EVENT_RXSTARTED))
        {
            /* Manually trigger RX if it was not yet started. */
            nrfy_uarte_task_trigger(p_uarte, NRF_UARTE_TASK_STARTRX);
        }

        if (p_cb->handler)
        {
            nrfy_uarte_int_enable(p_uarte, rx_int_mask);
        }
    }

    return NRFX_SUCCESS;
}

static nrfx_err_t rx_buffer_set(NRF_UARTE_Type *        p_uarte,
                                uarte_control_block_t * p_cb,
                                uint8_t *               p_data,
                                size_t                  length)
{
    nrfx_err_t err_code = NRFX_SUCCESS;

    if (p_cb->rx.curr.p_buffer == NULL ||
        (!p_cb->handler && nrfy_uarte_event_check(p_uarte, NRF_UARTE_EVENT_ENDRX)))
    {
        if (p_cb->rx.curr.p_buffer)
        {
            nrfy_uarte_event_clear(p_uarte, NRF_UARTE_EVENT_ENDRX);
        }

        p_cb->rx.curr.p_buffer = p_data;
        p_cb->rx.curr.length = length;

        if (rx_flushed_handler(p_uarte, p_cb))
        {
            nrfy_uarte_rx_buffer_set(p_uarte,
                                    &p_cb->rx.curr.p_buffer[p_cb->rx.off],
                                    p_cb->rx.curr.length - p_cb->rx.off);
            if (p_cb->flags & UARTE_FLAG_RX_ENABLED)
            {
                NRFX_ATOMIC_FETCH_AND(&p_cb->flags, ~UARTE_FLAG_RX_ABORTED);
                nrfy_uarte_task_trigger(p_uarte, NRF_UARTE_TASK_STARTRX);
                if (nrfy_uarte_event_check(p_uarte, NRF_UARTE_EVENT_RXTO))
                {
                    nrfy_uarte_event_clear(p_uarte, NRF_UARTE_EVENT_RXTO);
                }
            }
        }
    }
    else if (p_cb->rx.next.p_buffer == NULL)
    {
        p_cb->rx.next.p_buffer = p_data;
        p_cb->rx.next.length = length;

        nrfy_uarte_rx_buffer_set(p_uarte, p_data, length);
        if (p_cb->flags & UARTE_FLAG_RX_CONT)
        {
            nrfy_uarte_shorts_enable(p_uarte, NRF_UARTE_SHORT_ENDRX_STARTRX);
        }
    }
    else
    {
        err_code = NRFX_ERROR_BUSY;
    }

    return err_code;
}

static size_t get_curr_cache_buf_len(size_t cache_len, size_t len, size_t curr)
{
    if (len == 0)
    {
        return 0;
    }

    size_t rem = len - curr;

    return (rem > cache_len) ? NRFX_MIN(cache_len, rem / 2) : rem;
}

static size_t get_cache_buf_len(nrfx_uarte_rx_cache_t * p_cache)
{
    size_t user_len = p_cache->user[0].length;
    size_t len = get_curr_cache_buf_len(p_cache->cache_len, user_len, p_cache->started);

    if (!len)
    {
        if (p_cache->user[1].length) {
            p_cache->started = 0;
            len = get_curr_cache_buf_len(p_cache->cache_len, p_cache->user[1].length, 0);
        }
    }

    p_cache->started += len;

    return len;
}

nrfx_err_t nrfx_uarte_rx_buffer_set(nrfx_uarte_t const * p_instance,
                                    uint8_t *            p_data,
                                    size_t               length)
{
    NRFX_ASSERT(m_cb[p_instance->drv_inst_idx].state == NRFX_DRV_STATE_INITIALIZED);
    NRFX_ASSERT(UARTE_LENGTH_VALIDATE(p_instance->drv_inst_idx, length));
    NRFX_ASSERT(p_data);
    NRFX_ASSERT(length > 0);

    uarte_control_block_t * p_cb = &m_cb[p_instance->drv_inst_idx];
    NRF_UARTE_Type * p_uarte = p_instance->p_reg;
    bool cont = false;
    uint32_t int_enabled;
    nrfx_err_t err = NRFX_SUCCESS;

