guangli2015/freertos_nRF54l15/Source/nrfx/drivers/src/nrfx_uarte.c
    int_enabled = uarte_int_lock(p_uarte);

    if (p_cb->flags & UARTE_FLAG_RX_ABORTED)
    {
        err = NRFX_ERROR_INVALID_STATE;
    }
    else if (!nrf_dma_accessible_check(p_uarte, p_data))
    {
        // No cache buffer provided or blocking mode, transfer cannot be handled.
        if (!RX_CACHE_SUPPORTED || !p_cb->rx.p_cache || !p_cb->handler)
        {
            err = NRFX_ERROR_INVALID_ADDR;
        }
        else
        {
            nrfx_uarte_rx_cache_t * p_cache = p_cb->rx.p_cache;

            if (!p_cache->user[0].p_buffer)
            {
                p_cache->started = 0;
                p_cache->received = 0;
                p_cache->user[0].p_buffer = p_data;
                p_cache->user[0].length = length;
                p_data = p_cache->cache[0].p_buffer;
                length = get_cache_buf_len(p_cache);
                p_cache->idx = 1;
                p_cache->buf_req = true;
                NRFX_ATOMIC_FETCH_OR(&p_cb->flags, UARTE_FLAG_RX_USE_CACHE);
                cont = true;
            }
            else if (!p_cache->user[1].p_buffer)
            {
                p_cache->user[1].p_buffer = p_data;
                p_cache->user[1].length = length;
                err = NRFX_SUCCESS;
                if (!p_cb->rx.next.p_buffer)
                {
                    length = get_cache_buf_len(p_cache);
                    p_data = p_cache->cache[p_cache->idx++ & 0x1].p_buffer;
                    cont = true;
                }
            }
            else
            {
                err = NRFX_ERROR_BUSY;
            }
        }
    }
    else if (RX_CACHE_SUPPORTED && (p_cb->flags & UARTE_FLAG_RX_USE_CACHE))
    {
        // For first buffer cache was used. It is expected that following buffer will also
        // be cached.
        err = NRFX_ERROR_FORBIDDEN;
    }
    else
    {
        cont = true;
    }

    if (cont)
    {
        err = rx_buffer_set(p_uarte, p_cb, p_data, length);
    }

    uarte_int_unlock(p_uarte, int_enabled);

    return err;
}

static void rx_flush(NRF_UARTE_Type * p_uarte, uarte_control_block_t * p_cb)
{
    if (!(p_cb->flags & UARTE_FLAG_RX_KEEP_FIFO_CONTENT))
    {
        p_cb->rx.flush.length = 0;
        return;
    }

    if (USE_WORKAROUND_FOR_FLUSHRX_ANOMALY)
    {
        /* There is a HW bug which results in rx amount value not being updated
         * when fifo was empty. However, RXSTARTED event is only set if there was any data in
         * the FIFO. */
        nrfy_uarte_event_clear(p_uarte, NRF_UARTE_EVENT_RXSTARTED);
    }

    nrfy_uarte_rx_buffer_set(p_uarte, p_cb->rx.flush.p_buffer, UARTE_HW_RX_FIFO_SIZE);
    /* Final part of handling RXTO event is in ENDRX interrupt
     * handler. ENDRX is generated as a result of FLUSHRX task.
     */
    nrfy_uarte_event_clear(p_uarte, NRF_UARTE_EVENT_ENDRX);
    nrfy_uarte_task_trigger(p_uarte, NRF_UARTE_TASK_FLUSHRX);
    while (!nrfy_uarte_event_check(p_uarte, NRF_UARTE_EVENT_ENDRX))
    {
        /* empty */
    }
    nrfy_uarte_event_clear(p_uarte, NRF_UARTE_EVENT_ENDRX);

    if (USE_WORKAROUND_FOR_FLUSHRX_ANOMALY)
    {
        p_cb->rx.flush.length = nrfy_uarte_event_check(p_uarte, NRF_UARTE_EVENT_RXSTARTED) ?
                                nrfy_uarte_rx_amount_get(p_uarte) : 0;
    }
    else
    {
        p_cb->rx.flush.length = nrfy_uarte_rx_amount_get(p_uarte);
    }
    nrfy_uarte_event_clear(p_uarte, NRF_UARTE_EVENT_RXSTARTED);
}

static void wait_for_rx_completion(NRF_UARTE_Type *        p_uarte,
                                   uarte_control_block_t * p_cb)
{
    while(nrfy_uarte_event_check(p_uarte, NRF_UARTE_EVENT_RXTO) == false)
    {}

    nrfy_uarte_event_clear(p_uarte, NRF_UARTE_EVENT_RXSTARTED);
    nrfy_uarte_event_clear(p_uarte, NRF_UARTE_EVENT_ENDRX);
    nrfy_uarte_event_clear(p_uarte, NRF_UARTE_EVENT_RXTO);

    rx_flush(p_uarte, p_cb);
    disable_hw_from_rx(p_uarte);

    p_cb->rx.curr.p_buffer = NULL;
    p_cb->rx.next.p_buffer = NULL;
    release_rx(p_cb);
}

static nrfx_err_t rx_abort(NRF_UARTE_Type *        p_uarte,
                           uarte_control_block_t * p_cb,
                           bool                    disable_all,
                           bool                    sync)
{
    uint32_t flag;
    bool endrx_startrx = nrfy_uarte_shorts_get(p_uarte, NRF_UARTE_SHORT_ENDRX_STARTRX) != 0;
    uint32_t int_enabled;

    // We need to ensure that operation is not interrupted by the UARTE interrupt since we
    // are changing state flags. Otherwise interrupt may be executed with RX_ABORTED flag set
    // but before STOPRX task is triggered which may lead to unexpected behavior.
    if (!((p_cb->flags & (UARTE_FLAG_RX_ENABLED | UARTE_FLAG_RX_ABORTED)) ==
        UARTE_FLAG_RX_ENABLED))
    {
        // If we late with the abort we still want to clean flushed data since explicit
        // abort indicates that we are not interested in the data that ended up in the
        // FIFO.
        if (disable_all) {
            p_cb->rx.flush.length = 0;
        }

        return NRFX_ERROR_INVALID_STATE;
    }

    int_enabled = uarte_int_lock(p_uarte);

    if (disable_all || !endrx_startrx)
    {
        nrfy_uarte_shorts_disable(p_uarte, NRF_UARTE_SHORT_ENDRX_STARTRX);
        flag = UARTE_FLAG_RX_STOP_ON_END | UARTE_FLAG_RX_ABORTED | UARTE_FLAG_RX_FORCED_ABORT;
    }
    else
    {
        flag = UARTE_FLAG_RX_RESTARTED;
    }

    NRFX_ATOMIC_FETCH_OR(&p_cb->flags, flag);

    if (sync || !p_cb->handler)
    {
        nrfy_uarte_int_disable(p_uarte, rx_int_mask);
        nrfy_uarte_task_trigger(p_uarte, NRF_UARTE_TASK_STOPRX);
        wait_for_rx_completion(p_uarte, p_cb);
        int_enabled &= ~rx_int_mask;
    }
    else
    {
        nrfy_uarte_task_trigger(p_uarte, NRF_UARTE_TASK_STOPRX);
    }

    uarte_int_unlock(p_uarte, int_enabled);

    return NRFX_SUCCESS;
}

nrfx_err_t nrfx_uarte_rx_abort(nrfx_uarte_t const * p_instance, bool disable_all, bool sync)
{
    NRFX_ASSERT(p_instance);
    NRFX_ASSERT(m_cb[p_instance->drv_inst_idx].state == NRFX_DRV_STATE_INITIALIZED);

