guangli2015/freertos_nRF54l15/Source/nrfx/drivers/src/nrfx_uarte.c
    uarte_control_block_t * p_cb = &m_cb[p_instance->drv_inst_idx];
    NRF_UARTE_Type * p_uarte = p_instance->p_reg;

    return rx_abort(p_uarte, p_cb, disable_all, sync);
}

nrfx_err_t nrfx_uarte_rx(nrfx_uarte_t const * p_instance,
                         uint8_t *            p_data,
                         size_t               length)
{
    nrfx_err_t err_code = nrfx_uarte_rx_buffer_set(p_instance, p_data, length);
    uarte_control_block_t * p_cb = &m_cb[p_instance->drv_inst_idx];

    NRFX_ASSERT(p_cb->state == NRFX_DRV_STATE_INITIALIZED);
    NRFX_ASSERT(UARTE_LENGTH_VALIDATE(p_instance->drv_inst_idx, length));
    NRFX_ASSERT(p_data);
    NRFX_ASSERT(length > 0);

    if (err_code != NRFX_SUCCESS)
    {
        return err_code;
    }

    uint32_t flags = NRFX_UARTE_RX_ENABLE_CONT | NRFX_UARTE_RX_ENABLE_STOP_ON_END;

    err_code = nrfx_uarte_rx_enable(p_instance, flags);
    if (err_code != NRFX_ERROR_BUSY && err_code != NRFX_SUCCESS)
    {
        return err_code;
    }
    err_code = NRFX_SUCCESS;

    if (p_cb->handler == NULL)
    {
        size_t rx_amount = 0;

        do
        {
           err_code = nrfx_uarte_rx_ready(p_instance, &rx_amount);
        } while (err_code == NRFX_ERROR_BUSY);

        if ((err_code == NRFX_ERROR_ALREADY) || (length > rx_amount))
        {
            err_code = NRFX_ERROR_FORBIDDEN;
        }
        else
        {
            err_code = nrfx_uarte_rx_abort(p_instance, true, true);
            NRFX_ASSERT(err_code == NRFX_SUCCESS);
        }
    }

    return err_code;
}

nrfx_err_t nrfx_uarte_rx_ready(nrfx_uarte_t const * p_instance, size_t * p_rx_amount)
{
    uarte_control_block_t * p_cb = &m_cb[p_instance->drv_inst_idx];

    NRFX_ASSERT(p_cb->state == NRFX_DRV_STATE_INITIALIZED);

    if (p_cb->handler)
    {
        return NRFX_ERROR_FORBIDDEN;
    }

    if (!nrfy_uarte_enable_check(p_instance->p_reg))
    {
        if (p_rx_amount)
        {
            *p_rx_amount = nrfy_uarte_rx_amount_get(p_instance->p_reg);
        }

        return NRFX_ERROR_ALREADY;
    }
    else if (nrfy_uarte_event_check(p_instance->p_reg, NRF_UARTE_EVENT_ENDRX))
    {
        if (p_rx_amount)
        {
            *p_rx_amount = nrfy_uarte_rx_amount_get(p_instance->p_reg);
        }
        return NRFX_SUCCESS;
    }
    else
    {
        return NRFX_ERROR_BUSY;
    }
}

nrfx_err_t nrfx_uarte_int_trigger(nrfx_uarte_t const * p_instance)
{
    uarte_control_block_t * p_cb = &m_cb[p_instance->drv_inst_idx];

    if (!p_cb->handler)
    {
        return NRFX_ERROR_FORBIDDEN;
    }

    if (!(NRFX_ATOMIC_FETCH_OR(&p_cb->flags, UARTE_FLAG_TRIGGER) & UARTE_FLAG_TRIGGER))
    {
        NRFX_IRQ_PENDING_SET(nrfx_get_irq_number((void *)p_instance->p_reg));
    }

    return NRFX_SUCCESS;
}

uint32_t nrfx_uarte_errorsrc_get(nrfx_uarte_t const * p_instance)
{
    NRFX_ASSERT(m_cb[p_instance->drv_inst_idx].state != NRFX_DRV_STATE_UNINITIALIZED);
    /* Function must be used in blocking mode only. */
    NRFX_ASSERT(m_cb[p_instance->drv_inst_idx].handler == NULL);

    nrfy_uarte_event_clear(p_instance->p_reg, NRF_UARTE_EVENT_ERROR);
    return nrfy_uarte_errorsrc_get_and_clear(p_instance->p_reg);
}

bool nrfx_uarte_rx_new_data_check(nrfx_uarte_t const * p_instance)
{
    uarte_control_block_t * p_cb = &m_cb[p_instance->drv_inst_idx];
    bool flushed_data = (NRFX_ATOMIC_FETCH_AND(&p_cb->flags, ~UARTE_FLAG_RX_FROM_FLUSH) &
                        UARTE_FLAG_RX_FROM_FLUSH) != 0;

    if (nrfy_uarte_event_check(p_instance->p_reg, NRF_UARTE_EVENT_RXDRDY) || flushed_data)
    {
        nrfy_uarte_event_clear(p_instance->p_reg, NRF_UARTE_EVENT_RXDRDY);
        return true;
    }
    return false;
}

static void rxstarted_irq_handler(NRF_UARTE_Type * p_reg, uarte_control_block_t * p_cb)
{
    bool cache_used = RX_CACHE_SUPPORTED && (p_cb->flags & UARTE_FLAG_RX_USE_CACHE);

    // If both buffers are already setup just leave. It is possible in case
    // of following scenario. 1 byte was requested and received. RX done event
    // is generated and from that event nrfx_uarte_rx_buffer_set is called to
    // receive next RX. This sets current buffer. After ENDRX event is processed
    // then RXSTARTED event is processed (from that 1 byte transfer). From there
    // RX buffer request is called and next buffer is provided - both buffers are
    // set. Next RX is started and RXSTARTED event is triggered and we are in
    // the situation where both buffers are already set.
    if ((p_cb->rx.curr.p_buffer != NULL) && (p_cb->rx.next.p_buffer != NULL))
    {
        return;
    }

    if (!cache_used)
    {
        user_handler(p_cb, NRFX_UARTE_EVT_RX_BUF_REQUEST);
        return;
    }

    size_t len = get_cache_buf_len(p_cb->rx.p_cache);
    nrfx_uarte_rx_cache_t * p_cache = p_cb->rx.p_cache;

     if (len)
     {
        uint8_t * p_buf = p_cache->cache[p_cache->idx++ & 0x1].p_buffer;
        nrfx_err_t err = rx_buffer_set(p_reg, p_cb, p_buf, len);

        (void)err;
        NRFX_ASSERT(err == NRFX_SUCCESS);
    }

    if (p_cache->buf_req)
    {
        user_handler(p_cb, NRFX_UARTE_EVT_RX_BUF_REQUEST);
        p_cache->buf_req = false;
    }
}

static void rxto_irq_handler(NRF_UARTE_Type *        p_uarte,
                             uarte_control_block_t * p_cb)
{
    if (p_cb->rx.curr.p_buffer)
    {
        handler_on_rx_done(p_cb, p_cb->rx.curr.p_buffer, 0, true);
        p_cb->rx.curr.p_buffer = NULL;
    }

    if (RX_CACHE_SUPPORTED && (p_cb->flags & UARTE_FLAG_RX_USE_CACHE))
    {
        p_cb->rx.p_cache->user[0] = (nrfy_uarte_buffer_t){ NULL, 0 };
    }

    if (!(p_cb->flags & UARTE_FLAG_RX_FORCED_ABORT)) {
        rx_flush(p_uarte, p_cb);
    }

    on_rx_disabled(p_uarte, p_cb, p_cb->rx.flush.length);
}

static bool endrx_irq_handler(NRF_UARTE_Type *        p_uarte,
                              uarte_control_block_t * p_cb,
                              bool                    rxstarted)
{
    size_t rx_amount = (size_t)nrfy_uarte_rx_amount_get(p_uarte);
    bool premature = p_cb->flags & (UARTE_FLAG_RX_RESTARTED | UARTE_FLAG_RX_ABORTED);
    bool aborted = false;
    bool late = false;
    uint8_t *p_buf = p_cb->rx.curr.p_buffer;
    size_t len = rx_amount + p_cb->rx.off;

    p_cb->rx.curr = p_cb->rx.next;
    p_cb->rx.next = (nrfy_uarte_buffer_t){ NULL, 0 };
    handler_on_rx_done(p_cb, p_buf, len, premature);
    p_cb->rx.off = 0;

    NRFX_CRITICAL_SECTION_ENTER();

    p_cb->flags &= ~UARTE_FLAG_RX_RESTARTED;
    nrfy_uarte_shorts_disable(p_uarte, NRF_UARTE_SHORT_ENDRX_STARTRX);
    if (p_cb->flags & UARTE_FLAG_RX_ABORTED)
    {
            aborted = true;
    }
    else if (p_cb->rx.curr.p_buffer == NULL)
    {
        if (p_cb->flags & UARTE_FLAG_RX_STOP_ON_END)
        {
            nrfy_uarte_task_trigger(p_uarte, NRF_UARTE_TASK_STOPRX);
            p_cb->flags |= UARTE_FLAG_RX_ABORTED;
        }
    }
    else if (!((p_cb->flags & UARTE_FLAG_RX_CONT) &&
                (rxstarted || nrfy_uarte_event_check(p_uarte, NRF_UARTE_EVENT_RXSTARTED))))
    {
        // If continuous transfer is set then we expect that new RX is already started by short.
        // However it is possible that buffer was provided after ENDRX occurred. It can be checked
        // by examining RXSTARTED event. If it did not occur that indicates that second buffer did
        // not start but was set. It must be started manually. Usually RXSTARTED occurs almost
        // immediately after ENDRX (if short is set) so rxstarted variable check seems to be enough
        // but there are cases when RXSTARTED may be slightly delayed so if it is not set we
        // need to check HW register to make sure that it did not occur.
        nrfy_uarte_task_trigger(p_uarte, NRF_UARTE_TASK_STARTRX);
        if (nrfy_uarte_event_check(p_uarte, NRF_UARTE_EVENT_RXTO))
        {
            late = true;
        }
    }

    NRFX_CRITICAL_SECTION_EXIT();

    if (late)
    {
        nrfy_uarte_event_clear(p_uarte, NRF_UARTE_EVENT_RXTO);
        nrfy_uarte_event_clear(p_uarte, NRF_UARTE_EVENT_RXSTARTED);
        nrfy_uarte_task_trigger(p_uarte, NRF_UARTE_TASK_STOPRX);
        user_handler(p_cb, NRFX_UARTE_EVT_RX_BUF_TOO_LATE);
    }

