guangli2015/freertos_nRF54l15/Source/nrfx/drivers/src/nrfx_uarte.c
    return aborted;
}

static void pending_tx_handler(NRF_UARTE_Type *  p_uarte,
                               uarte_tx_data_t * p_tx)
{
    /* If there is a pending tx request, it means that uart_tx()
     * was called when there was ongoing blocking transfer. Handling
     * TXSTOPPED interrupt means that blocking transfer has completed.
     */
    NRFX_ASSERT(p_tx->next.p_buffer);

    NRFX_CRITICAL_SECTION_ENTER();

    if (nrfy_uarte_event_check(p_uarte, NRF_UARTE_EVENT_TXSTOPPED))
    {
        p_tx->curr.p_buffer = p_tx->next.p_buffer;
        p_tx->next.p_buffer = NULL;
        p_tx->amount = -1;
        tx_start(p_uarte, p_tx->curr.p_buffer, p_tx->curr.length, true);
    }

    NRFX_CRITICAL_SECTION_EXIT();
}

static void txstopped_irq_handler(NRF_UARTE_Type *        p_uarte,
                                  uarte_control_block_t * p_cb)
{
    nrfy_uarte_int_disable(p_uarte, NRF_UARTE_INT_TXSTOPPED_MASK);

    NRFX_CRITICAL_SECTION_ENTER();
    disable_hw_from_tx(p_uarte, p_cb);
    NRFX_CRITICAL_SECTION_EXIT();

    // If no length set, it means that it was a blocking transfer.
    if (p_cb->tx.curr.length == 0)
    {
        return;
    }

    // if p_buf is null it indicates that tx setup interrupted poll out and
    // tx buffer is pending.
    if (p_cb->tx.curr.p_buffer == NULL)
    {
        pending_tx_handler(p_uarte, &p_cb->tx);
        return;
    }

    size_t amount;
    bool use_cache;
    bool aborted = p_cb->flags & UARTE_FLAG_TX_ABORTED;
    NRFX_CRITICAL_SECTION_ENTER();
    if (p_cb->flags & UARTE_FLAG_TX_PENDING)
    {
        amount = 0;
        use_cache = !nrf_dma_accessible_check(p_uarte, p_cb->tx.curr.p_buffer);
    }
    else
    {
        amount = p_cb->tx.amount >= 0 ? (size_t)p_cb->tx.amount : nrfy_uarte_tx_amount_get(p_uarte);
        use_cache = true;
    }
    NRFX_CRITICAL_SECTION_EXIT();

    p_cb->tx.off += amount;
    if (p_cb->tx.off == p_cb->tx.curr.length || aborted)
    {
        uint32_t off = p_cb->tx.off;

        // Transfer completed.
        p_cb->flags &= ~UARTE_FLAG_TX_ABORTED;
        p_cb->tx.curr.length = 0;
        p_cb->tx.off = 0;
        user_handler_on_tx_done(p_cb, p_cb->tx.curr.p_buffer, off, aborted);
    }
    else
    {
        NRFX_CRITICAL_SECTION_ENTER();
        p_cb->flags &= ~UARTE_FLAG_TX_PENDING;
        tx_prepare_start(p_uarte, p_cb, use_cache);
        NRFX_CRITICAL_SECTION_EXIT();
    }
}

static void error_irq_handler(NRF_UARTE_Type *        p_uarte,
                              uarte_control_block_t * p_cb)
{
    user_handler_on_error(p_uarte, p_cb);
}

static void endtx_irq_handler(NRF_UARTE_Type * p_uarte, uarte_control_block_t * p_cb)
{
    if (NRFX_IS_ENABLED(NRFX_UARTE_CONFIG_TX_LINK) && (p_cb->flags & UARTE_FLAG_TX_LINKED))
    {
        uint8_t const * p_buf = p_cb->tx.curr.p_buffer;
        uint32_t len = p_cb->tx.curr.length;
        bool aborted = p_cb->flags & UARTE_FLAG_TX_ABORTED;

        nrfy_uarte_event_clear(p_uarte, NRF_UARTE_EVENT_ENDTX);
        // If we have no PPI connection then start the transfer ASAP.
        if (!nrfy_uarte_event_check(p_uarte, NRF_UARTE_EVENT_TXSTARTED) && !aborted)
        {
            nrfy_uarte_task_trigger(p_uarte, NRF_UARTE_TASK_STARTTX);
        }

#if NRF_UARTE_HAS_ENDTX_STOPTX_SHORT
        nrfy_uarte_int_disable(p_uarte, NRF_UARTE_INT_ENDTX_MASK);
        nrfy_uarte_shorts_enable(p_uarte, NRF_UARTE_SHORT_ENDTX_STOPTX);
#endif
        NRFX_CRITICAL_SECTION_ENTER();
        p_cb->tx.curr = p_cb->tx.next;
        p_cb->tx.next.length = 0;
        p_cb->tx.next.p_buffer = NULL;
        p_cb->flags &= ~UARTE_FLAG_TX_LINKED;
        aborted = p_cb->flags & UARTE_FLAG_TX_ABORTED;
        NRFX_CRITICAL_SECTION_EXIT();

        if (aborted)
        {
            p_cb->tx.amount = 0;
            len = nrfy_uarte_tx_amount_get(p_uarte);
        }

        user_handler_on_tx_done(p_cb, p_buf, len, aborted);
    }
    else
    {
        // Locking since blocking transfer can interrupt at anytime. In that case we don't
        // want to stop ongoing blocking transfer.
        NRFX_CRITICAL_SECTION_ENTER();
        if (nrfy_uarte_event_check(p_uarte, NRF_UARTE_EVENT_ENDTX))
        {
            nrfy_uarte_event_clear(p_uarte, NRF_UARTE_EVENT_ENDTX);
            nrfy_uarte_task_trigger(p_uarte, NRF_UARTE_TASK_STOPTX);
        }
        NRFX_CRITICAL_SECTION_EXIT();
    }
}

static void int_trigger_handler(uarte_control_block_t * p_cb)
{
    user_handler(p_cb, NRFX_UARTE_EVT_TRIGGER);
}

static inline bool event_check_and_clear(NRF_UARTE_Type * p_uarte,
                                         nrf_uarte_event_t event,
                                         uint32_t int_mask)
{
    if (nrfy_uarte_event_check(p_uarte, event) && (int_mask & NRFY_EVENT_TO_INT_BITMASK(event))) {
        nrfy_uarte_event_clear(p_uarte, event);
        return true;
    }

    return false;
}

static inline bool event_check(NRF_UARTE_Type * p_uarte,
                               nrf_uarte_event_t event,
                               uint32_t int_mask)
{
    return nrfy_uarte_event_check(p_uarte, event) &&
           (int_mask & NRFY_EVENT_TO_INT_BITMASK(event));
}

static void irq_handler(NRF_UARTE_Type * p_uarte, uarte_control_block_t * p_cb)
{
    // ENDTX must be handled before TXSTOPPED so we read event status in the reversed order of
    // handling.
    uint32_t int_mask = nrfy_uarte_int_enable_check(p_uarte, UINT32_MAX);
    bool txstopped = event_check(p_uarte, NRF_UARTE_EVENT_TXSTOPPED, int_mask);
    bool endtx =  event_check(p_uarte, NRF_UARTE_EVENT_ENDTX, int_mask);

    if (p_cb->handler)
    {
        if (event_check_and_clear(p_uarte, NRF_UARTE_EVENT_ERROR, int_mask))
        {
            error_irq_handler(p_uarte, p_cb);
        }

        // ENDRX must be handled before RXSTARTED. RXTO must be handled as the last one. We collect
        // state of all 3 events before processing to prevent reordering in case of higher interrupt
        // preemption. We read event status in the reversed order of handling.
        bool rxto = event_check_and_clear(p_uarte, NRF_UARTE_EVENT_RXTO, int_mask);
        bool rxstarted = event_check_and_clear(p_uarte, NRF_UARTE_EVENT_RXSTARTED, int_mask);
        bool endrx = event_check_and_clear(p_uarte, NRF_UARTE_EVENT_ENDRX, int_mask);
        bool rxdrdy = event_check_and_clear(p_uarte, NRF_UARTE_EVENT_RXDRDY, int_mask);

        if (rxdrdy)
        {
            user_handler(p_cb, NRFX_UARTE_EVT_RX_BYTE);
        }

        if (endrx)
        {
            // If interrupt was executed exactly when ENDRX occurred it is possible
            // that RXSTARTED (which is read before ENDRX) is read as false but it
            // actually occurred (if there is a linked reception). Read again to be sure.
            if (!rxstarted)
            {
                rxstarted = event_check_and_clear(p_uarte, NRF_UARTE_EVENT_RXSTARTED, int_mask);
            }

            if (endrx_irq_handler(p_uarte, p_cb, rxstarted) == true)
            {
                rxstarted = false;
            }
        }

        if (rxstarted)
        {
            rxstarted_irq_handler(p_uarte, p_cb);
        }

        if (rxto)
        {
            rxto_irq_handler(p_uarte, p_cb);
        }
    }

    if (endtx)
    {
        endtx_irq_handler(p_uarte, p_cb);
    }

    if (txstopped)
    {
        txstopped_irq_handler(p_uarte, p_cb);
    }

    if (NRFX_ATOMIC_FETCH_AND(&p_cb->flags, ~UARTE_FLAG_TRIGGER) & UARTE_FLAG_TRIGGER)
    {
        int_trigger_handler(p_cb);
    }
}

NRFX_INSTANCE_IRQ_HANDLERS(UARTE, uarte)

#endif // NRFX_CHECK(NRFX_UARTE_ENABLED)
